{"implication":{"symbol":{"applied":"⇒","allSymbols":["⇒","→","⊃","-\u003e"]},"description":"Este es el botón de implicación","axioms":{"explanation":"(A ⇒ B) es falso cuando A es verdadero y B es falso, pero verdadero en caso contrario. El operador de implicación es a menudo difícil de entender para los estudiantes, especialmente porque si A es falso y B es falso, la conclusión sigue siendo verdadera (también llamada vacuosamente verdadera). Nos referimos a A como el antecedente del condicional y a B como el consecuente. Una pieza importante del operador de flecha derecha es la idea de condiciones suficientes y necesarias. El antecedente es suficiente para el consecuente. El consecuente es necesario para el antecedente.","example":["Suppose A represents the proposition that someone is a bachelor, and B represents the proposition that someone is unmarried. Therefore, (A ⇒ B) reads \"If someone is a bachelor, then they are unmarried\". Since someone cannot be married and a bachelor, it holds true that being unmarried is necessary for being a bachelor (in other words, you cannot be a bachelor if you are married). Since everyone who is a bachelor is unmarried, it makes sense that being a bachelor is sufficient for being unmarried."]},"tooltip":"implicación","readAs":"implica; si ... entonces"},"biconditional":{"symbol":{"applied":"⇔","allSymbols":["⇔","≡","↔","\u003c-\u003e"]},"description":"Este es el botón de equivalencia","axioms":{"explanation":"(A ⇔ B) es cierto cuando A y B son iguales. Esto significa que A debe ser verdadera y B debe ser verdadera para que esta oración sea verdadera. Asimismo, A debe ser falso y B debe ser falso para que esta oración sea verdadera. Cuando difieren, la oración es falsa.","example":["(A ⇔ B)"]},"tooltip":"equivalencia","readAs":"si y solo si; \u0026quot;iff\u0026quot;; significa lo mismo que"},"negation":{"symbol":{"applied":"¬","allSymbols":["¬","˜","!"]},"description":"Este es el botón de negación","axioms":{"explanation":"El operador de negación ¬ invierte el valor de verdad de alguna proposición A. Entonces, si A es verdadera, entonces ¬A es falsa. Del mismo modo, si ¬A es falso, entonces ¬A es verdadero. El operador de negación funciona en cualquier oración y distribuye tanto los símbolos como los operadores.","example":["(¬¬A ⇔ A)","¬(A \u0026 B) is equivalent to (¬A ∨ ¬B). The negation operator follows the distributive property from math - we distribute it to everything inside of the parentheses.","~(A -\u003e ~B) is equivalent to (A \u0026 ~~B), which reduces to (A \u0026 B). Note that when we use a negation on an implication (also called a negated implication) sentence, we do not double-negate the antecedent; we reduce it to a proposition minus any negations."]},"tooltip":"negación","readAs":"no"},"conjunction":{"symbol":{"applied":"∧","allSymbols":["∧","^","·","\u0026"]},"description":"Este es el botón de conjunción.","axioms":{"explanation":"El enunciado (A ∧ B) es verdadero si A y B son ambos verdaderos; de lo contrario, es falso.","example":["(A ∧ B)"]},"tooltip":"conjunción","readAs":"y"},"disjunction":{"symbol":{"applied":"∨","allSymbols":["∨","∥","|"]},"description":"Este es el botón de disyunción.","axioms":{"explanation":"El enunciado (A ∨ B) es verdadero si A o B (o ambos) son verdaderos; si ambos son falsos, la afirmación es falsa.","example":["(A ∨ B)"]},"tooltip":"conjunción","readAs":"o"},"exclusiveDisjunction":{"symbol":{"applied":"⊕","allSymbols":["⊕","⊻","≢"]},"description":"Este es el botón de disyunción.","axioms":{"explanation":"La afirmación (A ⊕ B) es verdadera cuando A o B son verdaderas, pero no ambas.","example":["(¬A ⊕ B)"]},"tooltip":"disyunción exclusiva","readAs":"xor; Cualquiera o"},"turnstile":{"symbol":{"applied":"⊢","allSymbols":["⊢"]},"description":"Este es el botón del torniquete.","axioms":{"explanation":"x ⊢ y significa que x prueba (implica sintácticamente) y.","example":["(A → B) ⊢ (¬B → ¬A)"]},"tooltip":"torniquete","readAs":"prueba"},"doubleTurnstile":{"symbol":{"applied":"⊨","allSymbols":["⊨"]},"description":"Este es el botón del torniquete.","axioms":{"explanation":"x ⊨ y significa modelos x (implica semánticamente) y","example":["(A → B) ⊨ (¬B → ¬A)","(A → B) ⊨ (~A | B)"]},"tooltip":"torniquete doble","readAs":"modelos"},"universal":{"symbol":{"applied":"∀","allSymbols":["∀","()"]},"description":"Este es el botón de cuantificación universal.","axioms":{"explanation":"(∀x) Px o (x) Px significa que la proposición P es verdadera para todas las entradas x en un dominio D.","example":["(∀x)Px"]},"tooltip":"cuantificación universal","readAs":"para todos; para cualquier; para cada"},"existential":{"symbol":{"applied":"∃","allSymbols":["∃"]},"description":"Este es el botón de cuantificación existencial.","axioms":{"explanation":"(∃x) Px significa que hay al menos una entrada x en un dominio D que satisface la proposición P (que hace que P sea verdadera).","example":["(∃x)Px"]},"tooltip":"cuantificación existencial","readAs":"existe"}}