{"implication":{"symbol":{"applied":"⇒","allSymbols":["⇒","→","⊃","-\u003e"]},"description":"Este é o botón de implicación","axioms":{"explanation":"(A ⇒ B) é falso cando A é verdadeiro e B é falso, pero certo doutro xeito. O operador de implicación adoita ser difícil de comprender polos estudantes, especialmente porque se A é falso e B é falso, a conclusión segue sendo verdadeira (tamén chamada vacuamente certa). Referímonos a A como antecedente do condicional e a B como o consecuente. Un elemento importante do operador de frecha dereita é a idea de condicións suficientes e necesarias. O antecedente é suficiente para o conseguinte. O consecuente é necesario para o antecedente.","example":["Suppose A represents the proposition that someone is a bachelor, and B represents the proposition that someone is unmarried. Therefore, (A ⇒ B) reads \"If someone is a bachelor, then they are unmarried\". Since someone cannot be married and a bachelor, it holds true that being unmarried is necessary for being a bachelor (in other words, you cannot be a bachelor if you are married). Since everyone who is a bachelor is unmarried, it makes sense that being a bachelor is sufficient for being unmarried."]},"tooltip":"implicación","readAs":"implica; se ... entón"},"biconditional":{"symbol":{"applied":"⇔","allSymbols":["⇔","≡","↔","\u003c-\u003e"]},"description":"Este é o botón de equivalencia","axioms":{"explanation":"(A ⇔ B) é certo cando A e B son iguais. Isto significa que A debe ser verdadeiro e B debe ser verdadeiro para que esta frase sexa verdadeira. Do mesmo xeito, A debe ser falsa e B debe ser falsa para que esta frase sexa verdadeira. Cando difiren, a frase é falsa.","example":["(A ⇔ B)"]},"tooltip":"equivalencia","readAs":"se e só se; \"iff\"; significa o mesmo que"},"negation":{"symbol":{"applied":"¬","allSymbols":["¬","˜","!"]},"description":"Este é o botón de negación","axioms":{"explanation":"O operador de negación ¬ dá a volta ao valor de verdade dalgunha proposición A. Entón, se A é verdade, entón ¬A é falso. Do mesmo xeito, se ¬A é falso, entón ¬A é certo. O operador de negación traballa en calquera frase e distribúe sobre símbolos e operadores.","example":["(¬¬A ⇔ A)","¬(A \u0026 B) is equivalent to (¬A ∨ ¬B). The negation operator follows the distributive property from math - we distribute it to everything inside of the parentheses.","~(A -\u003e ~B) is equivalent to (A \u0026 ~~B), which reduces to (A \u0026 B). Note that when we use a negation on an implication (also called a negated implication) sentence, we do not double-negate the antecedent; we reduce it to a proposition minus any negations."]},"tooltip":"negación","readAs":"non"},"conjunction":{"symbol":{"applied":"∧","allSymbols":["∧","^","·","\u0026"]},"description":"Este é o botón de conxunción.","axioms":{"explanation":"A afirmación (A ∧ B) é verdadeira se A e B son verdadeiras; se non, é falso.","example":["(A ∧ B)"]},"tooltip":"conxunción","readAs":"e"},"disjunction":{"symbol":{"applied":"∨","allSymbols":["∨","∥","|"]},"description":"Este é o botón de disxunción.","axioms":{"explanation":"A afirmación (A ∨ B) é verdadeira se A ou B (ou ambas) son verdadeiras. Se ambos son falsos, entón é falso.","example":["(A ∨ B)"]},"tooltip":"disxunción","readAs":"ou"},"exclusiveDisjunction":{"symbol":{"applied":"⊕","allSymbols":["⊕","⊻","≢"]},"description":"Este é o botón de disxunción.","axioms":{"explanation":"A afirmación (A ⊕ B) é verdadeira cando A ou B son verdadeiras, pero non as dúas son verdadeiras.","example":["(¬A ⊕ B)"]},"tooltip":"disxunción exclusiva","readAs":"xor; ou ben ... ou ben"},"turnstile":{"symbol":{"applied":"⊢","allSymbols":["⊢"]},"description":"Este é o botón do torniquete.","axioms":{"explanation":"x ⊢ y significa que x demostra (implica sintácticamente) y.","example":["((A → B) ⊢ (¬B → ¬A))"]},"tooltip":"torniquete","readAs":"demostra"},"doubleTurnstile":{"symbol":{"applied":"⊨","allSymbols":["⊨"]},"description":"Este é o botón do torniquete.","axioms":{"explanation":"x ⊨ y significa x modelos (semánticamente implica) y","example":["(A → B) ⊨ (¬B → ¬A)","(A → B) ⊨ (~A | B)"]},"tooltip":"torniquete dobre","readAs":"modelos"},"universal":{"symbol":{"applied":"∀","allSymbols":["∀","()"]},"description":"Este é o botón de cuantificación universal.","axioms":{"explanation":"(∀x) Px ou (x) Px significa que a proposición P é verdadeira para todas as entradas x dun dominio D.","example":["(∀x)Px"]},"tooltip":"cuantificación universal","readAs":"para todos; para calquera; para cada un"},"existential":{"symbol":{"applied":"∃","allSymbols":["∃"]},"description":"Este é o botón de cuantificación existencial.","axioms":{"explanation":"(∃x) Px significa que hai polo menos unha entrada x nun dominio D que satisfai a proposición P (que fai que P sexa verdadeiro).","example":["(∃x)Px"]},"tooltip":"cuantificación existencial","readAs":"existe"}}